{"id":2792,"date":"2017-11-21T15:02:33","date_gmt":"2017-11-21T15:02:33","guid":{"rendered":"https:\/\/springvaleprimary.org\/?page_id=2792"},"modified":"2020-06-07T07:11:09","modified_gmt":"2020-06-07T06:11:09","slug":"phonicsandreading","status":"publish","type":"page","link":"https:\/\/springvaleprimary.org\/curriculum\/phonicsandreading\/","title":{"rendered":"Phonics and Reading"},"content":{"rendered":"<p>Our Reading leaders are Mrs R Fearn and Mrs D Royston. Please ask them for more information or support where needed.<\/p>\n<p><img data-attachment-id=\"7056\" data-permalink=\"https:\/\/springvaleprimary.org\/curriculum\/phonicsandreading\/091-2\/\" data-orig-file=\"https:\/\/i0.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/091.jpg?fit=2048%2C1365&amp;ssl=1\" data-orig-size=\"2048,1365\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"091\" data-image-description=\"\" data-medium-file=\"https:\/\/i0.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/091.jpg?fit=300%2C200&amp;ssl=1\" data-large-file=\"https:\/\/i0.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/091.jpg?fit=1024%2C683&amp;ssl=1\" loading=\"lazy\" class=\"alignnone wp-image-7056\" src=\"https:\/\/i0.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/091.jpg?resize=167%2C111&#038;ssl=1\" alt=\"\" width=\"167\" height=\"111\" srcset=\"https:\/\/i0.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/091.jpg?resize=300%2C200&amp;ssl=1 300w, https:\/\/i0.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/091.jpg?resize=1024%2C683&amp;ssl=1 1024w, https:\/\/i0.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/091.jpg?resize=768%2C512&amp;ssl=1 768w, https:\/\/i0.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/091.jpg?resize=1536%2C1024&amp;ssl=1 1536w, https:\/\/i0.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/091.jpg?resize=600%2C400&amp;ssl=1 600w, https:\/\/i0.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/091.jpg?w=2048&amp;ssl=1 2048w\" sizes=\"(max-width: 167px) 100vw, 167px\" data-recalc-dims=\"1\" \/> <img data-attachment-id=\"7054\" data-permalink=\"https:\/\/springvaleprimary.org\/curriculum\/phonicsandreading\/089-2\/\" data-orig-file=\"https:\/\/i1.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/089.jpg?fit=2048%2C1365&amp;ssl=1\" data-orig-size=\"2048,1365\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"089\" data-image-description=\"\" data-medium-file=\"https:\/\/i1.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/089.jpg?fit=300%2C200&amp;ssl=1\" data-large-file=\"https:\/\/i1.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/089.jpg?fit=1024%2C683&amp;ssl=1\" loading=\"lazy\" class=\"alignnone wp-image-7054\" src=\"https:\/\/i1.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/089.jpg?resize=255%2C170&#038;ssl=1\" alt=\"\" width=\"255\" height=\"170\" srcset=\"https:\/\/i1.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/089.jpg?resize=300%2C200&amp;ssl=1 300w, https:\/\/i1.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/089.jpg?resize=1024%2C683&amp;ssl=1 1024w, https:\/\/i1.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/089.jpg?resize=768%2C512&amp;ssl=1 768w, https:\/\/i1.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/089.jpg?resize=1536%2C1024&amp;ssl=1 1536w, https:\/\/i1.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/089.jpg?resize=600%2C400&amp;ssl=1 600w, https:\/\/i1.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/089.jpg?w=2048&amp;ssl=1 2048w\" sizes=\"(max-width: 255px) 100vw, 255px\" data-recalc-dims=\"1\" \/> <img data-attachment-id=\"7058\" data-permalink=\"https:\/\/springvaleprimary.org\/curriculum\/phonicsandreading\/093-2\/\" data-orig-file=\"https:\/\/i0.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/093.jpg?fit=2048%2C1367&amp;ssl=1\" data-orig-size=\"2048,1367\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"093\" data-image-description=\"\" data-medium-file=\"https:\/\/i0.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/093.jpg?fit=300%2C200&amp;ssl=1\" data-large-file=\"https:\/\/i0.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/093.jpg?fit=1024%2C684&amp;ssl=1\" loading=\"lazy\" class=\"alignnone wp-image-7058\" src=\"https:\/\/i0.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/093.jpg?resize=308%2C205&#038;ssl=1\" alt=\"\" width=\"308\" height=\"205\" srcset=\"https:\/\/i0.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/093.jpg?resize=300%2C200&amp;ssl=1 300w, https:\/\/i0.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/093.jpg?resize=1024%2C684&amp;ssl=1 1024w, https:\/\/i0.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/093.jpg?resize=768%2C513&amp;ssl=1 768w, https:\/\/i0.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/093.jpg?resize=1536%2C1025&amp;ssl=1 1536w, https:\/\/i0.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/093.jpg?resize=600%2C400&amp;ssl=1 600w, https:\/\/i0.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2019\/10\/093.jpg?w=2048&amp;ssl=1 2048w\" sizes=\"(max-width: 308px) 100vw, 308px\" data-recalc-dims=\"1\" \/><\/p>\n<p><strong>At Springvale we foster a love of reading from an early age.<\/strong><\/p>\n<p>To read our ‘intent statement’ for early Literacy and phonics, please see here:<\/p>\n<p><a href=\"https:\/\/springvaleprimary.org\/wp-content\/uploads\/2019\/12\/Early-Literacy-and-Phonics-Intent-Statement.docx\">Early Literacy and Phonics Intent Statement<\/a><\/p>\n<p>Mrs J Northrop leads our Reading Army on Wednesday PM (1.30pm onwards) please ask us if you would like to sign up!<\/p>\n<p>&nbsp;<\/p>\n<p>Progression pathways in reading across the whole school, here:<\/p>\n<p><a href=\"https:\/\/springvaleprimary.org\/wp-content\/uploads\/2020\/06\/Progression-in-phonics-and-early-reading.docx\">Progression in phonics and early reading<\/a><\/p>\n<p><a href=\"https:\/\/springvaleprimary.org\/wp-content\/uploads\/2020\/06\/Progression-in-reading-comprehension.docx\">Progression in reading comprehension<\/a><\/p>\n<p>&nbsp;<\/p>\n<p>Here is some information about how we teach phonics and the schemes\/resources we use:<\/p>\n<p><a href=\"https:\/\/springvaleprimary.org\/wp-content\/uploads\/2019\/11\/What-is-phonics-website.docx\">Phonics at Springvale Primary<\/a><\/p>\n<p>&nbsp;<\/p>\n<p>Reading support during COVID-19:<\/p>\n<p><a href=\"https:\/\/springvaleprimary.org\/wp-content\/uploads\/2020\/05\/Reading-Support-May-2020.pdf\">Reading Support May 2020<\/a><\/p>\n<p><a href=\"https:\/\/springvaleprimary.org\/wp-content\/uploads\/2020\/05\/Board.pdf\">Board<\/a><\/p>\n<p><a href=\"https:\/\/springvaleprimary.org\/wp-content\/uploads\/2020\/05\/Instructions.pdf\">Instructions<\/a><\/p>\n<p><a href=\"https:\/\/springvaleprimary.org\/wp-content\/uploads\/2020\/05\/Parents-may-like-to-use-this-reading-rewards-at-home.docx\">Parents may like to use this reading rewards at home<\/a><\/p>\n<p><a href=\"https:\/\/springvaleprimary.org\/wp-content\/uploads\/2020\/05\/t2-e-5011-author-reading-challenge-activity-sheet-.pdf\">t2-e-5011-author-reading-challenge-activity-sheet-<\/a><\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>We took a deep dive into Reading at Springvale to evaluate our work and consider the areas that we needed to improve further! Take a look below!<\/p>\n<p>&nbsp;<\/p>\n<p>September 2019<\/p>\n<p><u>Deep Dive into Reading<\/u><\/p>\n<p>&nbsp;<\/p>\n<p><u>Developing a Whole School Reading Culture<\/u><\/p>\n<p>How is reading shown to be valued and important throughout the educational setting?<\/p>\n<p>Do pupils have access to a school library? How is reading promoted within it?<\/p>\n<p>Do pupils have access to immersive reading and environments and displays?<\/p>\n<p>Do pupils see staff reading for pleasure? Are the children encouraged to read for pleasure?<\/p>\n<p>OFSTED report comments Feb 2018<\/p>\n<p><em>You are determined to promote the importance of developing pupils’ reading skills. As a result, you and your staff have created a positive reading culture where pupils value and enjoy reading. Staff provide pupils with regular opportunities to read at school and at home. The bright, well-resourced library provides a popular space to sit and read. Pupils who spoke to me are adamant that they enjoy reading and that they read at home and at school on a regular basis. Consequently, pupils make strong progress in their reading.<\/em><\/p>\n<ul>\n<li>F2 new starter parental meetings promote the importance Springvale puts on reading with children every day and the high levels of expectation to complete phonics homework in order for them to reach their full potential.<\/li>\n<li>Daily streamed phonics is completed every day from F2-Y2 using the Read, Write Inc strategy. Groups are assessed and children are moved on a regular basis to maximise children’s progress and attainment. Every area that is dedicated to phonics has the correct resources to support children’s learning.<\/li>\n<li>Daily guided reading sessions are completed every day from Y2-Y6 using age appropriate, good quality texts. Each session is assessed, as well as termly assessments, to help us regularly move children to different groups in order to maximise their progress and attainment. New guided reading books are purchased regularly to maintain the best quality books.<\/li>\n<li>Regular staff meetings and INSETs are set aside to discuss reading\/phonics. Moderation is completed after each reading assessment to evaluate progress and attainment.<\/li>\n<li>Every class has a designated reading corner to emphasise the importance of reading. All children have access to age appropriate books, magazines, newspapers etc that they may enjoy.<\/li>\n<li>A newly refurbished library is well used for: phonics sessions, one to one reading, book clubs, guided reading and reading boosters. It is also used by classes for children to choose free reading books.<\/li>\n<li>Displays around school promote reading-showing pictures of children reading, reading books clubs, teachers reading etc.<\/li>\n<li>Classes 1-6 get a letter at the beginning of each year, along with a reading log, which shows the level of expectation of how often and for how long children read, depending on their age as well as the reading targets that are being covered throughout the year. These logs are checked on a weekly basis by the class teacher to emphasise to both parents and children alike that reading is valued and extremely important in our setting. Letters are sent home if the reading log is not completed to the correct standard.<\/li>\n<li>Reading assemblies are delivered every week to impart the importance of reading to the whole school. Authors are discussed as well as books. Children are read to and are heard reading during assemblies.<\/li>\n<li>Letters are sent home to encourage parents to read with their children and government statistics are shared in order to tell parents the importance reading has on academic progress as well as communication skills and mental health and wellbeing.<\/li>\n<li>All KS2 classes have a class book, which they share with the children every day. Children get the chance to discuss this with their teacher.<\/li>\n<li>First news reporters in Year 5 have to read and report on headline news every week for display in school.<\/li>\n<li>School promote a love of reading by organising “Books for Breakfast” for F1-Y6 twice a year where parents come and enjoy a bacon sandwich or a piece of fruit and find a place in school to sit and read with their children. These events are extremely well attended and enjoyed by all-display in the front entrance of school.<\/li>\n<li>Summer Reading Challenge is promoted every year with a special assembly to explain all about how children can get involved. Newsletters are sent to parents to engage them in the event too. We also encourage this event by running our own school competition where the children can win a Kindle if they complete the reading challenge over the summer. This year we had over 50 children complete the challenge and the winner was JB from Year 4.<\/li>\n<li>Every year school celebrate Roald Dahl Day- display in the library as well as World Book Day- prizes and fun activities are run throughout the day.<\/li>\n<li>Book Fair every year to encourage a love of reading- children get the chance to visit the fair before and after school.<\/li>\n<li>Springvale promote famous authors such as William Shakespeare every year. KS2 has the Young Shakespeare Company perform a famous play, which is then read within the classroom. We have had Macbeth, A Midsummer Night’s Dream, The Tempest and Hamlet performed.<\/li>\n<li>We have had a TIE company perform Tom’s Midnight Garden performed for KS2- it was the class book for Year 5.<\/li>\n<li>The poet Ian McMillan has performed in school and delivered workshops to several classes.<\/li>\n<li>KS2 have celebrated the author J M Barrie- each class read his famous work Peter Pan and completed work around the story.<\/li>\n<li>KS1 children have seen The Elves and the Shoemaker as well as Jack and the Beanstalk to support their class books and their topic Fairy Tales.<\/li>\n<li>Year 5 children visited the Sheffield Crucible to see Awful Auntie-which was their class book.<\/li>\n<li>Teachers reading their favourite book is on display.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p>Does your school use a whole-class or group guided reading system? Why has this been chosen? How can you prove that it is effective?<\/p>\n<ul>\n<li>F2-Y5 use a group approach to guided reading using texts that offered and cater for a diverse range of reading preferences and show a range of diverse characters. It was implemented so that every teacher had a clear plan, questioning and assessment format to work with each group guided reading session throughout school.<\/li>\n<li>Year 6 have a whole-class approach to guided reading (using the VIPERS approach) with some additional small group reading sessions (where required) for intervention or support.<\/li>\n<li>Through guided reading visits, discussions with children around their reading and assessments we can evaluate the effectiveness of guided reading.<\/li>\n<\/ul>\n<p>Reading KS2<\/p>\n<table>\n<tbody>\n<tr>\n<td width=\"150\">Attainment<\/td>\n<td width=\"75\">ARE<\/td>\n<td width=\"75\">GD<\/td>\n<\/tr>\n<tr>\n<td width=\"150\">2017<\/td>\n<td width=\"75\">71%<\/p>\n<p>72%<\/td>\n<td width=\"75\">50%<\/p>\n<p>25%<\/td>\n<\/tr>\n<tr>\n<td width=\"150\">2018<\/td>\n<td width=\"75\">90%<\/p>\n<p>75%<\/td>\n<td width=\"75\">31%<\/p>\n<p>28%<\/td>\n<\/tr>\n<tr>\n<td width=\"150\">2019<\/td>\n<td width=\"75\">86%<\/p>\n<p>73.2%<\/td>\n<td width=\"75\">28.6%<\/p>\n<p>26.9%<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n<p>Are all pupils reading quality, age appropriate texts with the required level of challenge? How are books selected? Do pupils get the opportunity to select their own book choices?<\/p>\n<p>&nbsp;<\/p>\n<ul>\n<li>School have bought a new Benchmarking system to make sure that all children are reading the correct level of book band books. The children choose their own book band\/early free reader\/free reading\/platinum book to enjoy. These books have been purchased based on their quality, age appropriateness and required level of challenge.<\/li>\n<li>Guided reading is grouped on ability- books are purchased to match this ability using recommendations from Pie Corbett, from winners of the Carnegie Medal and from research completed on the Craft for Writing course to inform decisions on appropriateness, as well as engagement, of texts.<\/li>\n<li>All teachers read these books to set age appropriate, as well as challenging questions.<\/li>\n<li>Through monitoring children have been seen to engage with their guided reading sessions.<\/li>\n<li>Children are encouraged to use sentence stems in their answers in guided reading. They are encouraged to find and retrieve information, decode words, use inference, prediction, analysis and summarising information as well as evidence from the text in order to answer questions.<\/li>\n<li>Children are encouraged to discuss their own reading preferences and opinions on texts during guided reading sessions and they all complete book reviews at the end of the book to evaluate opinion.<\/li>\n<li>Children read aloud Yr 2-Yr 5 during guided reading sessions once a week. They also are heard reading aloud during comprehension sessions, which take place alongside guided reading sessions. They are also heard reading when reading the class book in KS2.<\/li>\n<li>Reading corners offer a wide range of reading materials including comics, magazines and newspapers.<\/li>\n<li>All class teachers read to the children on a daily basis to promote a love of reading and to model reading aloud with intonation, volume and fluency.<\/li>\n<li>Children who are identified as not making progress are given one to one reading with the school’s Reading Army or with an LSA.  Do you offer high-quality texts matched to pupils’ reading preferences, phonic ability and interests?<\/li>\n<li>School have invested in new texts to match pupils’ phonic ability.<\/li>\n<li>School have designated staff meeting time to evaluate the provision of texts within reading in the entire educational setting and how they are displayed to promote reading. Thus ensuring that the texts offered cater for a diverse range of reading preferences and show a range of diverse characters.Does the quality and condition of your resources reflect the school’s reading culture? Are books organised for ease of use and displayed to encourage enthusiasm for reading?<\/li>\n<li>Books are in boxes for book- banded books. Guided reading books, early free reading, free reading and platinum books are displayed on shelves. Books in the library are alphabetically ordered by author’s surname. Book corners in classrooms ensure all children have access to books.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p>Do you have a range of other reading activities and games within each classroom for children to practise reading skills?<\/p>\n<p>&nbsp;<\/p>\n<ul>\n<li>The reading corners provide reading activities for children to have a go at. These include reading comprehension cards- word games- match words with sounds etc.Are English lessons (or whole topics) planned around high quality texts?<\/li>\n<li><\/li>\n<li><\/li>\n<li>Staff have had CPD to focus on quality planning based around whole-class texts- see planning sheets for examples: My Friend Walter, Charlie and the Chocolate Factory, Skellig etc.<\/li>\n<li><\/li>\n<li><\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p><u>Assessment of Reading<\/u><\/p>\n<p>&nbsp;<\/p>\n<p>How is reading assessed during guided reading sessions? How does this feed into future guided reading sessions?<\/p>\n<p>&nbsp;<\/p>\n<ul>\n<li>Each session is planned based on previous reading assessments. During the session all teachers note down who was able to answer questions and whether they managed to achieve the objectives from that session. This then can be evaluated and the next sessions can be planned for. Evidence of how this is implemented: see assessments notes.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p>What other assessment is used to evaluate pupil progress in reading? How often? How is this recorded and used to inform planning?<\/p>\n<p>&nbsp;<\/p>\n<ul>\n<li>Scholastic reading assessments are used in KS2 three times a year. The results are recorded and tracked on target tracker to track the progress and attainment. Moderation after these assessments is completed to identify any gaps in learning or lack of progress\/attainment. In the interim comprehension sessions as well as guided reading are completed on a weekly basis by every child. Benchmarking is completed at least three times a year.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p>What strategies are put into place for children who are seen to be underachieving when assessed?<\/p>\n<p>&nbsp;<\/p>\n<ul>\n<li>One to one reading-using LSAs or the Reading Army<\/li>\n<li>Additional guided reading sessions completed with an adult<\/li>\n<li>Inference training<\/li>\n<li>Fluency training<\/li>\n<li>Parental support and guidance<\/li>\n<li>Booster sessions<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p><u>Reading intervention Programmes<\/u><\/p>\n<p><u> <\/u><\/p>\n<p>What reading intervention programmes run in school and how\/why were they chosen for specific groups or pupils?<\/p>\n<ul>\n<li>One to one reading<\/li>\n<li>Inference training<\/li>\n<li>Fluency training<\/li>\n<li>Comprehension skills<\/li>\n<li>Booster sessions<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p>When do the sessions take place? Do children miss out on learning from other curriculum areas?<\/p>\n<ul>\n<li>These interventions take place mainly in the afternoon-parts of sessions are missed due to interventions.<\/li>\n<\/ul>\n<p><u> <\/u><\/p>\n<p>How are pupils selected to take part? How is their progress monitored and tracked?<\/p>\n<ul>\n<li>Each child on an intervention is tracked through attendance and evaluative feedback is written up after every session. Children are tested on entry level when they start the intervention and then tested again when they finish. This is shared with the SENCO and the class teacher. The intervention is then either stopped if completed or continued if successful.<\/li>\n<li><\/li>\n<\/ul>\n<p>Are gifted and talented children offered reading intervention sessions to give them further challenge?<\/p>\n<ul>\n<li>Gifted and talented children in year 6 have been given additional guided reading sessions with an LSA on an afternoon.<\/li>\n<li>Gifted and talented children from years 4,5 and 6 are invited to book club to share, read and discuss challenging texts.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p>Do interventions help children reach ARE?<\/p>\n<ul>\n<li>See data.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p>Parental Engagement<\/p>\n<p>Are parents and carers regularly listening to their children read at home? How is this encouraged?<\/p>\n<p>Do parents\/carers complete reading home\/school diaries or reading records?<\/p>\n<p>Do parents\/carers act as role models as readers to their children? How does school help them to do this?<\/p>\n<p>&nbsp;<\/p>\n<ul>\n<li>All teachers check the children’s reading logs every week to check that parents\/carers are listening to their children read. If parents are not reading with their children then letters are sent home. If still there is no improvement parents are invited into school to share the importance of reading with their children. We encourage this through letters home to parents to encourage the importance of reading and by mentioning the importance of reading at home through assemblies and in class. Parents’ meetings are opportunities for all teachers to mention the importance of reading.<\/li>\n<li>School promotes a love of reading by regularly inviting parents to reading events e.g. books for breakfast, book fair etc.<\/li>\n<li>School provides parent phonics workshops to highlight the importance of reading at home throughout the key stages.<\/li>\n<li>Reading Army<\/li>\n<li>Books for Breakfast<\/li>\n<\/ul>\n<p>Next steps<\/p>\n<ul>\n<li>Invite parents to reading workshops to highlight the importance of reading at home through key stages.<\/li>\n<li>Could start a parents’ book club<\/li>\n<li>Open the school library after school and encourage children to visit with their parents and carers.<\/li>\n<li>Provide support sessions for parents and carers who struggle with their own literacy skills in an open, friendly and non-judgemental way.<\/li>\n<li>Conduct peer interviews on attitudes to reading across the school and collate the results, looking for any common patterns that could be addressed.<\/li>\n<li>Encourage pupil involvement (perhaps through school council representatives) in new purchases to ensure a diverse range of materials are bought that match reading preferences and a wide range of interests. Base new guided reading sessions on these books.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p>Pupil Voice Questions<\/p>\n<p>&nbsp;<\/p>\n<ul>\n<li>Are pupils asked for their opinions on reading within school? What actions have been taken based on these opinions?<\/li>\n<li>Are pupils’ attitudes to reading the same throughout every year group? What reasons can you give for changes\/possible negativity within certain age groups?<\/li>\n<li>Are pupils actively involved in choosing what they read within their classroom?<\/li>\n<\/ul>\n<div class=\"grammarly-disable-indicator\"><\/div>\n","protected":false},"excerpt":{"rendered":"<p>Our Reading leaders are Mrs R Fearn and Mrs D Royston. Please ask them for more information or support where needed. At Springvale we foster a love of reading from an early age. To read our ‘intent statement’ for early Literacy and phonics, please see here: Early Literacy and Phonics Intent Statement Mrs J Northrop [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":2779,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"spay_email":""},"jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/P9oLUD-J2","jetpack-related-posts":[{"id":2742,"url":"https:\/\/springvaleprimary.org\/year-2\/","url_meta":{"origin":2792,"position":0},"title":"Year 2","date":"November 21, 2017","format":false,"excerpt":"Welcome to Class 2 – The Sensational Seacoles! Our class teacher is Mrs Royston and Mrs Andrew on Fridays. Our teaching assistants are Mrs Northrop, Mrs Gale and Ms Heeley.   We are really pleased to be back in school with everyone! Each day we have English, Maths, phonics and…","rel":"","context":"Similar post","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2020\/09\/Y2-staff-2020-300x225.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":2779,"url":"https:\/\/springvaleprimary.org\/curriculum\/","url_meta":{"origin":2792,"position":1},"title":"Curriculum","date":"November 21, 2017","format":false,"excerpt":"HOME SCHOOL SUPPORT During the current Covid-19 outbreak situation we will be adding links to useful learning opportunities and resources here. These will be in sections relating to classes, subject leaders or additional need pupils and each section will be in order of publication with the most recent content at…","rel":"","context":"Similar post","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2020\/04\/SMART-web-300x231.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":2854,"url":"https:\/\/springvaleprimary.org\/curriculum\/modern-foreign-languages\/","url_meta":{"origin":2792,"position":2},"title":"Wellbeing and Modern Foreign Languages (MfL)","date":"November 21, 2017","format":false,"excerpt":"Our wellbeing lead is Mr L McClure. Some resources to support families during the period of school closure: Health team resources and links   We follow a curriculum programme called Jigsaw with significant additional content some of which- especially assembly material- is supplemented by 1Decision online materials and interactive videos.…","rel":"","context":"Similar post","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":2796,"url":"https:\/\/springvaleprimary.org\/curriculum\/maths\/","url_meta":{"origin":2792,"position":3},"title":"Maths","date":"November 21, 2017","format":false,"excerpt":"Mathematics To see our 'intent statement' for maths, please see here: Maths Intent Statement   To see our curriculum overview, please see here: Maths Curriculum Overview Maths National-Curriculum-Progression-Primary (used with thanks to White Rose maths) Progression Map for Multiplication Our maths leaders are Mrs N Evans and Mrs R Mayston.…","rel":"","context":"Similar post","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":2808,"url":"https:\/\/springvaleprimary.org\/curriculum\/art\/","url_meta":{"origin":2792,"position":4},"title":"Art and Design Technology (DT)","date":"November 21, 2017","format":false,"excerpt":"To read our 'intent statement' for Art, please see here: Art Intent Statement   To read our 'intent statement' for Design Technology (DT), please see here: DT Intent Statement   We are developing our subject leader roles in school and all newly appointed leaders are reviewing their subject's curriculum. The…","rel":"","context":"Similar post","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":2806,"url":"https:\/\/springvaleprimary.org\/curriculum\/pe\/","url_meta":{"origin":2792,"position":5},"title":"Physical Education (PE), Sport and Dance","date":"November 21, 2017","format":false,"excerpt":"Our PE, dance and sport team is led by Mrs N Exley. Please feel free to ask her for any advice or support required. Our PE link Governor is Mr Andrew Noble.   Some free PE resources during school closure (more on the main 'curriculum' start tab...) real PE at…","rel":"","context":"Similar post","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/springvaleprimary.org\/wp-content\/uploads\/2020\/01\/Sports-1-300x200.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/springvaleprimary.org\/wp-json\/wp\/v2\/pages\/2792"}],"collection":[{"href":"https:\/\/springvaleprimary.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/springvaleprimary.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/springvaleprimary.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/springvaleprimary.org\/wp-json\/wp\/v2\/comments?post=2792"}],"version-history":[{"count":11,"href":"https:\/\/springvaleprimary.org\/wp-json\/wp\/v2\/pages\/2792\/revisions"}],"predecessor-version":[{"id":8334,"href":"https:\/\/springvaleprimary.org\/wp-json\/wp\/v2\/pages\/2792\/revisions\/8334"}],"up":[{"embeddable":true,"href":"https:\/\/springvaleprimary.org\/wp-json\/wp\/v2\/pages\/2779"}],"wp:attachment":[{"href":"https:\/\/springvaleprimary.org\/wp-json\/wp\/v2\/media?parent=2792"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}